/**
 * НДС в процентах или ТЕГ НДС: Тег 1043, Из нее расчет тега 1079
 */
export enum Tax {
    /**
     * НДС 0%
     */
    T0 = 0,

    /**
     * НДС 10%
     */
    T10 = 10,

    /**
     * НДС 20%
     */
    T20 = 20,

    /**
     * НДС не облагается
     */
    NONE = -1,

    /**
     * НДС 20 /120
     */
    T120 = 120,

    /**
     * НДС 10 /110
     */
    T110 = 110
}

/**
 * Tag 1214
 *
 * Признак способа расчета
 */
export enum SignMethodCalculation {
    /**
     * ПРЕДОПЛАТА 100%
     *
     * Полная предварительная оплата до момента
     * передачи предмета расчета
     */
    PREPAYMENT = 1,

    /**
     * ПРЕДОПЛАТА
     *
     * Частичная предварительная оплата до момента
     * передачи предмета расчета
     */
    PARTIAL_PREPAYMENT = 2,

    /**
     * АВАНС
     */
    PREPAID_EXPENSE = 3,

    /**
     * ПОЛНЫЙ РАСЧЕТ
     *
     * Полная оплата, в том числе с учетом аванса
     * (предварительной оплаты) в момент
     * передачи предмета расчета
     */
    FULL_CALCULATION = 4,

    /**
     * ЧАСТИЧНЫЙ РАСЧЕТ И КРЕДИТ
     *
     * Частичная оплата предмета расчета в момент
     * его передачи с последующей оплатой
     * в кредит
     */
    PARTIAL_SETTLEMENT_AND_CREDIT = 5,

    /**
     * ПЕРЕДАЧА В КРЕДИТ
     *
     * Передача предмета расчета без его оплаты
     * в момент его передачи с последующей
     * оплатой в кредит
     */
    TRANSFER_TO_CREDIT = 6,

    /**
     * ОПЛАТА КРЕДИТА
     *
     * Оплата предмета расчета после его передачи
     * с оплатой в кредит (оплата кредита)
     */
    LOAN_PAYMENT = 7
}

/**
 * Tag 1212
 */
export enum SignCalculationObject {
    /**
     * ТОВАР
     *
     * Реализация товара, за исключением подакцизного
     * товара и товара, подлежащего маркировке
     * средствами идентификации
     */
    PRODUCT = 1,

    /**
     * ПОДАКЦИЗНЫЙ ТОВАР
     *
     * Реализация подакцизного товара, за исключением товара,
     * подлежащего маркировке средствами идентификации
     */
    EXCISED_PRODUCT = 2,

    /**
     * РАБОТА
     *
     * Выполнение работы
     */
    WORK = 3,

    /**
     * УСЛУГА
     *
     * Оказание услуги
     */
    SERVICE = 4,

    /**
     * СТАВКА АЗАРТНОЙ ИГРЫ
     *
     * Прием ставок
     */
    GAMBLING_BET = 5,

    /**
     * ВЫИГРЫШ АЗАРТНОЙ ИГРЫ
     *
     * Выплата денежных средств в виде выигрыша
     */
    WIN_GAMBLING = 6,

    /**
     * ЛОТЕРЕЙНЫЙ БИЛЕТ
     *
     * Прием денежных средств при реализации лотерейных билетов
     */
    LOTTERY_TICKET = 7,

    /**
     * ВЫИГРЫШ ЛОТЕРЕИ
     *
     * Выплата денежных средств в виде выигрыша
     */
    LOTTERY_WINNING = 8,

    /**
     * ПРЕДОСТАВЛЕНИЕ РИД
     *
     * Предоставлении прав на использование результатов
     * интеллектуальной деятельности или средств
     * индивидуализации
     */
    RIA_PROVISION = 9,

    /**
     * ПЛАТЕЖ
     *
     * Аванс, задаток, предоплата, кредит, взнос в счет оплаты,
     * пени, штраф, вознаграждение, бонус и
     * иной аналогичный предмет расчета
     */
    PAYMENT = 10,

    /**
     * АГЕНТСКОЕ ВОЗНАГРАЖДЕНИЕ
     *
     * Вознаграждение (банковского)платежного агента/субагента,
     * комиссионера, поверенного или иным агентом
     */
    AGENTS_COMMISSION = 11,

    /**
     * СОСТАВНОЙ ПРЕДМЕТ РАСЧЕТА
     *
     * Предмет расчета, состоящем из предметов, каждому из которых
     * может быть присвоено вышестоящее значение
     */
    COMPONENT_SUBJECT_OF_CALCULATION = 12,

    /**
     * ИНОЙ ПРЕДМЕТ РАСЧЕТА
     *
     * Предмет расчета, не относящемуся к предметам расчета,
     * которым может быть присвоено вышестоящее значение
     */
    OTHER_SUBJECT_OF_CALCULATION = 13,

    /**
     * ИМУЩЕСТВЕННОЕ ПРАВО
     *
     * Передача имущественных прав
     */
    PROPERTY_LAW = 14,

    /**
     * ВНЕРЕАЛИЗАЦИОННЫЙ ДОХОД
     */
    NON_OPERATING_INCOME = 15,

    /**
     * СТРАХОВЫЕ ВЗНОСЫ
     *
     * Суммы расходов, уменьшающих сумму налога (авансовых платежей)
     * в соответствии с пунктом 3.1 статьи 346.21
     * Налогового кодекса Российской Федерации
     */
    INSURANCE_PREMIUM = 16,

    /**
     * ТОРГОВЫЙ СБОР
     *
     * Суммы уплаченного торгового сбора
     */
    TRADING_FEE = 17,

    /**
     * КУРОРТНЫЙ СБОР
     */
    RESORT_FEE = 18,

    /**
     * ЗАЛОГ
     */
    PLEDGE = 19,

    /**
     * РАСХОД
     *
     * Суммы произведенных расходов в соответствии со статьей
     * 346.16 Налогового кодекса Российской Федерации,
     * уменьшающих доход
     */
    CONSUMPTION = 20,

    /**
     * ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ ПЕНСИОННОЕ СТРАХОВАНИЕ ИП
     * или ВЗНОСЫ НА ОПС ИП
     */
    ENTREPRENEUR_PENSION_INSURANCE = 21,

    /**
     * ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ ПЕНСИОННОЕ СТРАХОВАНИЕ
     * или ВЗНОСЫ НА ОПС
     */
    PENSION_INSURANCE = 22,

    /**
     * ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ МЕДИЦИНСКОЕ СТРАХОВАНИЕ ИП
     * или ВЗНОСЫ НА ОМС ИП
     */
    ENTREPRENEUR_HEALTH_INSURANCE = 23,

    /**
     * ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ МЕДИЦИНСКОЕ СТРАХОВАНИЕ
     * или ВЗНОСЫ НА ОМС
     */
    HEALTH_INSURANCE = 24,

    /**
     * ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ СОЦИАЛЬНОЕ СТРАХОВАНИЕ
     * или ВЗНОСЫ НА ОСС
     */
    SOCIAL_INSURANCE = 25,

    /**
     * ПЛАТЕЖ КАЗИНО
     *
     * Прием и выплата денежных средств при осуществлении
     * казино и залами игровых автоматов расчетов с
     * использованием обменных знаков
     * игорного заведения
     */
    CASINO_PAYMENT = 26,

    /**
     * ВЫДАЧА ДЕНЕЖНЫХ СРЕДСТВ или ВЫДАЧА ДС
     *
     * Выдача денежных средств банковским платежным агентом
     */
    WITHDRAWAL_OF_CASH = 27,

    /**
     * Реализация подакцизного товара, подлежащего маркировке
     * средством идентификации, не имеющего кода маркировки
     */
    АТНМ = 30,

    /**
     * Реализация подакцизного товара, подлежащего маркировке
     * средством идентификации, имеющего код маркировки
     */
    ATM = 31,

    /**
     * Реализация товара, подлежащего маркировке средством
     * идентификации, не имеющего кода маркировки,
     * за исключением подакцизного товара
     */
    ТНМ = 32,

    /**
     * Реализация товара, подлежащего маркировке средством
     * идентификации, имеющего код маркировки,
     * за исключением подакцизного товара
     */
    TM = 33
}

/**
 * Мера количества предмета расчета. Тег ОФД 2108, Значение из таблицы 114 (ФФД)
 */
export enum MeasureOfQuantity {
    /**
     * Штуки или единицы
     */
    PIECES = 0,

    /**
     * Грамм
     */
    GRAMS = 10,

    /**
     * Килограмм
     */
    KILOGRAMS = 11,

    /**
     * Тонна
     */
    TONS = 12,

    /**
     * Сантиметры
     */
    CENTIMETERS = 20,

    /**
     * Дециметры
     */
    DECIMETERS = 21,

    /**
     * Метры
     */
    METERS = 22,

    /**
     * Квадратные сантиметры
     */
    SQUARE_CENTIMETERS = 30,

    /**
     * Квадратные дециметры
     */
    SQUARE_DECIMETERS = 31,

    /**
     * Квадратные метры
     */
    SQUARE_METERS = 32,

    /**
     * Миллилитры
     */
    MILLILITERS = 40,

    /**
     * Литры
     */
    LITERS = 41,

    /**
     * Кубические метры
     */
    CUBIC_METERS = 42,

    /**
     * Киловатт в час
     */
    KILOWATT_PER_HOUR = 50,

    /**
     * Градусы Кельвина (Гкал)
     */
    DEGREE_KELVIN = 51,

    /**
     * Сутки
     */
    DAYS = 70,

    /**
     * Час
     */
    HOURS = 71,

    /**
     * Минуты
     */
    MINUTES = 72,

    /**
     * Секунды
     */
    SECONDS = 73,

    /**
     * Килобайты
     */
    KILOBYTES = 80,

    /**
     * Мегабайты
     */
    MEGABYTES = 81,

    /**
     * Гигабайты
     */
    GIGABYTES = 82,

    /**
     * Терабайты
     */
    TERABYTES = 83,

    /**
     * Прочее
     */
    OTHER = 255
}

export type GoodCodeData = {
    /**
     * штрих-код маркировки товара со сканера (нужно настроить сканер так чтобы не проглатывал управляющие символы)
     * Поддерживаются ШК:
     * Без идентификатора экземпляра товара: EAN8, EAN13, ITF14
     * С идентификатором экземпляра товара: GS1, ШК шуб, ШК табачной продукции., ЕГАИС-2, ЕГАИС-3
     *
     * @example '0104300943734342212413195240818240640291ffd092MDEwNDMwMDk0MzczNDM'
     */
    BarCode: string;

    /**
     * Проверять содержит ли ШК кода маркировки идентификатор экземпляра товара (если вообще не указать - true)
     * Для некоторых товаров нужно передавать ШК EAN-13, тогда это поле устанавливайте в 'false'
     */
    ContainsSerialNumber: boolean;

    /**
     * Все равно регистрировать чек даже если код маркировки не прошел проверку
     * Только для работы по ФФД 1.2
     */
    AcceptOnBad: boolean;
};

/**
 * Признак агента. Тег ОФД 1222. Поле не обязательное. Можно вообще не указывать.
 */
export enum AgentSign {
    /**
     * "Банковский платежный агент:"
     * Оказание услуг пользователем, являющимся банковским платежным агентом
     */
    BANK_PAYMENT_AGENT = 0,

    /**
     * "Банковский платежный субагент:"
     * Оказание услуг пользователем, являющимся банковским платежным субагентом
     */
    BANK_PAYMENT_SUBAGENT = 1,

    /**
     * "Платежный агент:"
     * Оказание услуг пользователем, являющимся платежным агентом
     */
    PAYING_AGENT = 2,

    /**
     * "Платежный субагент:"
     * Оказание услуг пользователем, являющимся платежным субагентом
     */
    PAYMENT_SUBAGENT = 3,

    /**
     * "Поверенный:"
     * Оказание услуг пользователем, являющимся поверенным
     */
    ATTORNEY = 4,

    /**
     * "Комиссионер:"
     * Оказание услуг пользователем, являющимся комиссионером
     */
    Commissioner = 5,

    /**
     * "Агент:" Оказание услуг пользователем, являющимся агентом и
     * не являющимся банковским платежным агентом (субагентом), платежным агентом
     * (субагентом), поверенным, комиссионером
     */
    AGENT = 6
}

export type AgentData = {
    /**
     * Операция платежного агента. Тег ОФД 1044
     *
     * @example '95315'
     */
    PayingAgentOperation: string;

    /**
     * Телефон платежного агента. Тег ОФД 1073
     *
     * @example '+79995554422'
     */
    PayingAgentPhone: string;

    /**
     * Телефон оператора по приему платежей. Тег ОФД 1074
     *
     * @example '+72223334455'
     */
    ReceivePaymentsOperatorPhone: string;

    /**
     * Телефон оператора перевода. Тег ОФД 1075
     *
     * @example '+74447776655'
     */
    MoneyTransferOperatorPhone: string;

    /**
     * Наименование оператора перевода. Тег ОФД 1026
     *
     * @example 'ООО Рога и копыта'
     */
    MoneyTransferOperatorName: string;

    /**
     * Адрес оператора перевода. Тег ОФД 1005
     *
     * @example 'Москва, зубовский бульвар 44'
     */
    MoneyTransferOperatorAddress: string;

    /**
     * ИНН оператора перевода. Тег ОФД 1016
     *
     * @example '430601071197'
     */
    MoneyTransferOperatorVATIN: string;
};

/**
 * Данные поставщика платежного агента. Тег ОФД 1224
 */
export type PurveyorData = {
    /**
     * Телефон поставщика. Тег ОД 1171
     *
     * @example '+76662229955'
     */
    PurveyorPhone: string;

    /**
     * Наименование поставщика. Тег ОФД 1225
     *
     * @example 'ООО "Гаражик в деревне"'
     */
    PurveyorName: string;

    /**
     * ИНН поставщика. Тег ОФД 1226
     *
     * @example '430601071197'
     */
    PurveyorVATIN: string;
};

export type Register = {
    /**
     * Наименование товара 64 символа, Тег 1059
     *
     * @example 'Сапоги женские DF-3099-1'
     */
    Name: string;

    /**
     * Количество товара (3 знака после запятой), Тег 1023
     */
    Quantity: number;

    /**
     * Цена за шт. без скидки (2 знака после запятой)
     */
    Price: number;

    /**
     * Конечная сумма строки с учетом всех скидок /наценок;
     * (2 знака после запятой), Из нее расчет тега 1079
     */
    Amount: number;

    /**
     * Отдел, по которому ведется продажа
     */
    Department?: number;

    /**
     * НДС в процентах или ТЕГ НДС: Тег 1043, Из нее расчет тега 1079
     */
    Tax?: Tax;

    /**
     * Признак способа расчета. Тег ОФД 1214. Для ФФД.1.05 и выше обязательное поле
     */
    SignMethodCalculation?: SignMethodCalculation;

    /**
     * Признак предмета расчета. Тег ОФД 1212. Для ФФД.1.05 и выше обязательное поле
     */
    SignCalculationObject?: SignCalculationObject;

    /**
     * Мера количества предмета расчета. Тег ОФД 2108, Значение из таблицы 114 (ФФД)
     * Некоторые ККТ при передачи кода маркировки требуют чтобы MeasureOfQuantity = 0 (шт.или ед.)
     */
    MeasureOfQuantity?: 0;

    /**
     * Общее количество товара в упаковке(тег 1294)
     * Передавать ТОЛЬКО при продаже товара из упаковки маркировки!!
     * Если товар не из упаковки - Не передавать (или передавать null)!
     * Как правило передавать не нужно (или передавать null)
     * Должно быть больше или равно продаваемому количеству товара
     * Имеет смысл только при передачи совместно с кодом маркировки
     * При указании PackageQuantity - поле MeasureOfQuantity должно быть строго равно 0 (шт. или ед.) и не равняться 0!
     * При указании PackageQuantity - поле Quantity (количество продаваемого товара) должно быть строго целое число
     *
     * Например при продаже 2 сигарет из упаковки в 22 шт.
     *   MeasureOfQuantity = 0,
     *   Quantity = 2,
     *   PackageQuantity = 22
     */
    PackageQuantity: number | null;

    /**
     * Цифровой код страны происхождения товара в соответствии с Общероссийским
     * классификатором стран мира 3 симв. Тег 1230
     *
     * @example '156'
     */
    CountryOfOrigin?: string;

    /**
     * Регистрационный номер таможенной декларации 32 симв. Тег 1231
     *
     * @example '54180656/1345865/3435625/23'
     */
    CustomsDeclaration?: string;

    /**
     * Сумма акциза с учетом копеек, включенная в стоимость предмета расчета Тег 1229
     */
    ExciseAmount?: number | null;

    /**
     * КИЗ (контрольный идентификационный знак) товарной номенклатуры,
     * Тег ОФД 1162 (честный знак), можно не указывать
     */
    GoodCodeData?: GoodCodeData;

    /**
     * Признак агента. Тег ОФД 1222. Поле не обязательное. Можно вообще не указывать.
     */
    AgentSign?: AgentSign;

    /**
     * Данные агента. Тег ОД 1223.
     * Поле не обязательное. Обязательно если установлено поле "AgentSign"
     * Можно вообще не указывать.
     */
    AgentData?: AgentData;

    /**
     * Данные поставщика платежного агента. Тег ОФД 1224
     * Поле не обязательное. Обязательно если установлено поле "AgentSign"
     * Можно вообще не указывать.
     */
    PurveyorData?: PurveyorData;

    /**
     * Дополнительный реквизит предмета расчета тег 1191, Только для ФФД 1.1 !
     *
     * @example 'Тест-доп.реквизит'
     */
    AdditionalAttribute?: string;
};
