/**
 * НДС в процентах (Tag 1043)
 *
 *  -1 - НДС не облагается
 *   0 - НДС 0%
 *  10 -  НДС 10%
 *  20 - НДС 20%
 * 120 - НДС 20 /120
 * 110 - НДС 10 /110
 */
export type Tax = -1 | 0 | 10 | 20 | 120 | 110;

/**
 * Признак способа расчета (Tag 1214)
 *
 * 1 - ПРЕДОПЛАТА 100%
 * 2 - ПРЕДОПЛАТА
 * 3 - АВАНС
 * 4 - ПОЛНЫЙ РАСЧЕТ
 * 5 - ЧАСТИЧНЫЙ РАСЧЕТ И КРЕДИТ
 * 6 - ПЕРЕДАЧА В КРЕДИТ
 * 7 - ОПЛАТА КРЕДИТА
 */
export type SignMethodCalculation = 1 | 2 | 3 | 4 | 5 | 6 | 7;

/**
 * Tag 1212
 *
 * 1  - ТОВАР
 * 2  - ПРОДАКЦИЗНЫЙ ТОВАР
 * 3  - РАБОТА
 * 4  - УСЛУГА
 * 5  - СТАВКА АЗАРТНОЙ ИГРЫ
 * 6  - ВЫИГРЫШ АЗАРТНОЙ ИГРЫ
 * 7  - ЛОТЕРЕЙНЫЙ БИЛЕТ
 * 8  - ВЫИГРЫШ ЛОТЕРЕИ
 * 9  - ПРЕДОСТАВЛЕНИЕ РИД
 * 10 - ПЛАТЕЖ
 * 11 - АГЕНТСКОЕ ВОЗНАГРАЖДЕНИЕ
 * 12 - СОСТАВНОЙ ПРЕДМЕТ РАСЧЕТА
 * 13 - ИНОЙ ПРЕДМЕТ РАСЧЕТА
 * 14 - ИМУЩЕСТВЕННОЕ ПРАВО
 * 15 - ВНЕРЕАЛИЗАЦИОННЫЙ ДОХОД
 * 16 - СТРАХОВЫЕ ВЗНОСЫ
 * 17 - ТОРГОВЫЙ СБОР
 * 18 - КУРОРТНЫЙ СБОР
 * 19 - ЗАЛОГ
 * 20 - РАСХОД
 * 21 - ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ ПЕНСИОННОЕ СТРАХОВАНИЕ ИП или ВЗНОСЫ НА ОПС ИП
 * 22 - ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ ПЕНСИОННОЕ СТРАХОВАНИЕ или ВЗНОСЫ НА ОПС
 * 23 - ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ МЕДИЦИНСКОЕ СТРАХОВАНИЕ ИП или ВЗНОСЫ НА ОМС ИП
 * 24 - ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ МЕДИЦИНСКОЕ СТРАХОВАНИЕ или ВЗНОСЫ НА ОМС
 * 25 - ВЗНОСЫ НА ОБЯЗАТЕЛЬНОЕ СОЦИАЛЬНОЕ СТРАХОВАНИЕ или ВЗНОСЫ НА ОСС
 * 26 - ПЛАТЕЖ КАЗИНО
 * 27 - ВЫДАЧА ДЕНЕЖНЫХ СРЕДСТВ или ВЫДАЧА ДС
 * 30 - Реализация подакцизного товара, подлежащего маркировке средством идентификации, не имеющего кода маркировки
 * 31 - Реализация подакцизного товара, подлежащего маркировке средством идентификации, имеющего код маркировки
 * 32 - Реализация товара, подлежащего маркировке средством идентификации, не имеющего кода маркировки, за исключением подакцизного товара
 * 33 - Реализация товара, подлежащего маркировке средством идентификации, имеющего код маркировки, за исключением подакцизного товара
 */
export type SignCalculationObject =
    | 1
    | 2
    | 3
    | 4
    | 5
    | 6
    | 7
    | 8
    | 9
    | 10
    | 11
    | 12
    | 13
    | 14
    | 15
    | 16
    | 17
    | 18
    | 19
    | 20
    | 21
    | 22
    | 23
    | 24
    | 25
    | 26
    | 27
    | 30
    | 31
    | 32
    | 33;

/**
 * Мера количества предмета расчета. Тег ОФД 2108, Значение из таблицы 114 (ФФД)
 *
 *   0 - Штуки или единицы
 *  10 - Грамм
 *  11 - Килограмм
 *  12 - Тонна
 *  20 - Сантиметры
 *  21 - Дециметры
 *  22 - Метры
 *  30 - Квадратные сантиметры
 *  31 - Квадратные дециметры
 *  32 - Квадратные метры
 *  40 - Миллилитры
 *  41 - Литры
 *  42 - Кубические метры
 *  50 - Киловатт в час
 *  51 - Градусы Кельвина (Гкал)
 *  70 - Сутки
 *  71 - Час
 *  72 - Минута
 *  73 - Секунда
 *  80 - Килобайты
 *  81 - Мегабайты
 *  82 - Гигабайты
 *  83 - Терабайты
 * 255 - Прочее
 */
export type MeasureOfQuantity = 0 | 10 | 11 | 12 | 20 | 21 | 22 | 30 | 31 | 32 | 40 | 41 | 42 | 50 | 51 | 70 | 71 | 72 | 73 | 80 | 81 | 82 | 83 | 255;

export type GoodCodeData = {
    /**
     * штрих-код маркировки товара со сканера (нужно настроить сканер так чтобы не проглатывал управляющие символы)
     * Поддерживаются ШК:
     * Без идентификатора экземпляра товара: EAN8, EAN13, ITF14
     * С идентификатором экземпляра товара: GS1, ШК шуб, ШК табачной продукции., ЕГАИС-2, ЕГАИС-3
     *
     * @example '0104300943734342212413195240818240640291ffd092MDEwNDMwMDk0MzczNDM'
     */
    BarCode: string;

    /**
     * Проверять содержит ли ШК кода маркировки идентификатор экземпляра товара (если вообще не указать - true)
     * Для некоторых товаров нужно передавать ШК EAN-13, тогда это поле устанавливайте в 'false'
     */
    ContainsSerialNumber: boolean;

    /**
     * Все равно регистрировать чек даже если код маркировки не прошел проверку
     * Только для работы по ФФД 1.2
     */
    AcceptOnBad: boolean;
};

/**
 * Признак агента. Тег ОФД 1222. Поле не обязательное.
 *
 * 0 - Банковский платежный агент
 * 1 - Банковский платежный субагент
 * 2 - Платежный агент
 * 3 - Платежный субагент
 * 4 - Поверенный
 * 5 - Комиссионер
 * 6 - Агент
 */
export type AgentSign = 0 | 1 | 2 | 3 | 4 | 5 | 6;

export type AgentData = {
    /**
     * Операция платежного агента. Тег ОФД 1044
     *
     * @example '95315'
     */
    PayingAgentOperation: string;

    /**
     * Телефон платежного агента. Тег ОФД 1073
     *
     * @example '+79995554422'
     */
    PayingAgentPhone: string;

    /**
     * Телефон оператора по приему платежей. Тег ОФД 1074
     *
     * @example '+72223334455'
     */
    ReceivePaymentsOperatorPhone: string;

    /**
     * Телефон оператора перевода. Тег ОФД 1075
     *
     * @example '+74447776655'
     */
    MoneyTransferOperatorPhone: string;

    /**
     * Наименование оператора перевода. Тег ОФД 1026
     *
     * @example 'ООО Рога и копыта'
     */
    MoneyTransferOperatorName: string;

    /**
     * Адрес оператора перевода. Тег ОФД 1005
     *
     * @example 'Москва, зубовский бульвар 44'
     */
    MoneyTransferOperatorAddress: string;

    /**
     * ИНН оператора перевода. Тег ОФД 1016
     *
     * @example '430601071197'
     */
    MoneyTransferOperatorVATIN: string;
};

/**
 * Данные поставщика платежного агента. Тег ОФД 1224
 */
export type PurveyorData = {
    /**
     * Телефон поставщика. Тег ОД 1171
     *
     * @example '+76662229955'
     */
    PurveyorPhone: string;

    /**
     * Наименование поставщика. Тег ОФД 1225
     *
     * @example 'ООО "Гаражик в деревне"'
     */
    PurveyorName: string;

    /**
     * ИНН поставщика. Тег ОФД 1226
     *
     * @example '430601071197'
     */
    PurveyorVATIN: string;
};

export type Register = {
    /**
     * Наименование товара 64 символа, Тег 1059
     *
     * @example 'Сапоги женские DF-3099-1'
     */
    Name: string;

    /**
     * Количество товара (3 знака после запятой), Тег 1023
     */
    Quantity: number;

    /**
     * Цена за шт. без скидки (2 знака после запятой)
     */
    Price: number;

    /**
     * Конечная сумма строки с учетом всех скидок /наценок;
     * (2 знака после запятой), Из нее расчет тега 1079
     */
    Amount: number;

    /**
     * Отдел, по которому ведется продажа
     */
    Department?: number;

    /**
     * НДС в процентах или ТЕГ НДС: Тег 1043, Из нее расчет тега 1079
     */
    Tax?: Tax;

    /**
     * Признак способа расчета. Тег ОФД 1214. Для ФФД.1.05 и выше обязательное поле
     */
    SignMethodCalculation?: SignMethodCalculation;

    /**
     * Признак предмета расчета. Тег ОФД 1212. Для ФФД.1.05 и выше обязательное поле
     */
    SignCalculationObject?: SignCalculationObject;

    /**
     * Мера количества предмета расчета. Тег ОФД 2108, Значение из таблицы 114 (ФФД)
     * Некоторые ККТ при передачи кода маркировки требуют чтобы MeasureOfQuantity = 0 (шт.или ед.)
     */
    MeasureOfQuantity?: 0;

    /**
     * Общее количество товара в упаковке(тег 1294)
     * Передавать ТОЛЬКО при продаже товара из упаковки маркировки!!
     * Если товар не из упаковки - Не передавать (или передавать null)!
     * Как правило передавать не нужно (или передавать null)
     * Должно быть больше или равно продаваемому количеству товара
     * Имеет смысл только при передачи совместно с кодом маркировки
     * При указании PackageQuantity - поле MeasureOfQuantity должно быть строго равно 0 (шт. или ед.) и не равняться 0!
     * При указании PackageQuantity - поле Quantity (количество продаваемого товара) должно быть строго целое число
     *
     * Например при продаже 2 сигарет из упаковки в 22 шт.
     *   MeasureOfQuantity = 0,
     *   Quantity = 2,
     *   PackageQuantity = 22
     */
    PackageQuantity: number | null;

    /**
     * Цифровой код страны происхождения товара в соответствии с Общероссийским
     * классификатором стран мира 3 симв. Тег 1230
     *
     * @example '156'
     */
    CountryOfOrigin?: string;

    /**
     * Регистрационный номер таможенной декларации 32 симв. Тег 1231
     *
     * @example '54180656/1345865/3435625/23'
     */
    CustomsDeclaration?: string;

    /**
     * Сумма акциза с учетом копеек, включенная в стоимость предмета расчета Тег 1229
     */
    ExciseAmount?: number | null;

    /**
     * КИЗ (контрольный идентификационный знак) товарной номенклатуры,
     * Тег ОФД 1162 (честный знак), можно не указывать
     */
    GoodCodeData?: GoodCodeData;

    /**
     * Признак агента. Тег ОФД 1222. Поле не обязательное. Можно вообще не указывать.
     */
    AgentSign?: AgentSign;

    /**
     * Данные агента. Тег ОД 1223.
     * Поле не обязательное. Обязательно если установлено поле "AgentSign"
     * Можно вообще не указывать.
     */
    AgentData?: AgentData;

    /**
     * Данные поставщика платежного агента. Тег ОФД 1224
     * Поле не обязательное. Обязательно если установлено поле "AgentSign"
     * Можно вообще не указывать.
     */
    PurveyorData?: PurveyorData;

    /**
     * Дополнительный реквизит предмета расчета тег 1191, Только для ФФД 1.1 !
     *
     * @example 'Тест-доп.реквизит'
     */
    AdditionalAttribute?: string;
};
